[
  {
    "month": 1,
    "day": 1,
    "year": null,
    "description": "The Circumcision of our Lord Jesus Christ, and the Octave of his Nativity. At Rome, St. Almachius, martyr, who, by the command of Alipius, governor of the city, was killed by gladiators because he said, 'Today is the Octave of our Lord's birth; put an end to the worship of idols, and abstain from unclean sacrifices.'",
    "source_text": "Roman Martyrology"
  },
  {
    "month": 12,
    "day": 25,
    "year": null,
    "description": "In the year 5199 from the creation of the world, when God in the beginning created heaven and earth, from the flood 2957, from the birth of Abraham 2015, from Moses and the exodus of the people from Egypt 1510, from the anointing of David as king 1032, in the sixty-fifth week according to the prophecy of Daniel, in the one hundred and ninety-fourth Olympiad, in the year 752 from the foundation of the city of Rome, in the forty-second year of the empire of Octavian Augustus, when the whole world was at peace, in the sixth age of the world, Jesus Christ, eternal God, and Son of the eternal Father, desirous to sanctify the world by His most merciful coming, having been conceived of the Holy Ghost, and nine months having passed since His conception, is born in Bethlehem of Juda, having become Man of the Virgin Mary.",
    "source_text": "Roman Martyrology"
  },
  {
    "month": 3,
    "day": 19,
    "year": null,
    "description": "In Judea, the birthday of St. Joseph, spouse of the Most Blessed Virgin Mary, Confessor. The Sovereign Pontiff Pius IX declared him Patron of the Universal Church, at the desire of the prelates of the entire Catholic world.",
    "source_text": "Roman Martyrology"
  },
  {
    "month": 8,
    "day": 15,
    "year": null,
    "description": "The Dormition, or Assumption of the Most Holy Virgin Mary, Mother of God, when she was taken up into heaven, together with her body, in a wonderful manner. Pope Pius XII has defined as a dogma of faith that the Blessed Virgin Mary was assumed body and soul into heavenly glory.",
    "source_text": "Roman Martyrology"
  }
]
